---
kind: other
id: Methods.T:Autodesk.Revit.DB.Events.DocumentPrintedEventArgs
source: html/12f80c2c-e4d1-2c34-ffac-ad213cd5fd31.htm
---
# DocumentPrintedEventArgs Methods

Returns ElementIds of the views that that failed to print (if any).